## Directors

In [39]:
#open libraries
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline
import numpy as np

In [40]:
df_crew = pd.read_csv('C:/Users/camil/Desktop/Projeto Integrador/dados/title.crew.tsv.gz', compression='gzip', header=0 , quotechar='"', error_bad_lines=False, sep = '\t', na_values=['\\N'])

In [41]:
df_basics = pd.read_csv('C:/Users/camil/Desktop/Projeto Integrador/dados/basics_simple.csv')

In [42]:
crew = df_crew.join(df_basics.set_index('tconst'), on = 'tconst', how = 'inner')

In [43]:
director = crew.pivot_table(values = 'averageRating',
                            index = 'directors',
                            aggfunc = 'mean')

In [44]:
director2= crew.pivot_table(values = 'tconst',
                            index = 'directors',
                            aggfunc = 'count')

In [45]:
director = director.join(director2, on = 'directors')

In [46]:
director.reset_index(inplace = True)

In [47]:
director.rename(columns={'averageRating':'director_rating', 'tconst':'n_movies'}, inplace = True)

In [48]:
names = pd.read_csv('C:/Users/camil/Desktop/Projeto Integrador/dados/name.basics.tsv.gz', compression='gzip', header=0 , quotechar='"', error_bad_lines=False, sep = '\t', na_values=['\\N'])

In [49]:
# remover os atores e diretores que ja morreram
names = names[names.deathYear.isnull()]

In [50]:
director.rename(columns = {'directors': 'nconst'}, inplace = True)

In [51]:
director_df = director.merge(names, on = 'nconst', how = 'inner')

In [52]:
director_df = director_df[['primaryName', 'director_rating', 'n_movies']]
director_df.columns = ['name', 'avg', 'n']
director_df['type'] = 'director'

In [53]:
director_df.head()

                  name       avg   n      type
0          Alan Miller  7.200000   1  director
1  Armin Mueller-Stahl  6.600000   1  director
2         Gérard Pirès  5.266667  12  director
3          Woody Allen  7.048936  47  director
4          Dan Aykroyd  5.100000   1  director

## Actors

In [54]:
principals = pd.read_csv('C:/Users/camil/Desktop/Projeto Integrador/dados/title.principals.tsv.gz', compression='gzip', header=0 , quotechar='"', error_bad_lines=False, sep = '\t', na_values=['\\N'])

In [55]:
principals

,tconst,ordering,nconst,category,job,characters
0,tt0000001,1,nm1588970,self,NaN,"[""Self""]"
1,tt0000001,2,nm0005690,director,NaN,NaN
2,tt0000001,3,nm0374658,cinematographer,director of photography,NaN
3,tt0000002,1,nm0721526,director,NaN,NaN
4,tt0000002,2,nm1335271,composer,NaN,NaN
...,...,...,...,...,...,...
39422889,tt9916880,5,nm0996406,director,principal director,NaN
39422890,tt9916880,6,nm1482639,writer,NaN,NaN
39422891,tt9916880,7,nm2586970,writer,books,NaN
39422892,tt9916880,8,nm1594058,producer,producer,NaN
39422893,tt9916880,9,nm1052583,actress,NaN,"[""Mum"",""Tidy Ted"",""Fang""]"

In [56]:
actor = principals[(principals.category == 'actor') | (principals.category == 'actress')]

In [57]:
df_actor = actor.merge(df_basics, on = 'tconst', how = 'inner')

In [58]:
actor_avg = df_actor.pivot_table(values = 'averageRating',
                            index = 'nconst',
                            aggfunc = 'mean')
actor_avg.reset_index(inplace = True)

In [59]:
actor_n = df_actor.pivot_table(values = 'tconst',
                              index = 'nconst',
                              aggfunc = 'count')
actor_n.reset_index(inplace = True)
actor_n.rename(columns = {'tconst' : 'n_movies'}, inplace = True)

In [60]:
actor_df = actor_avg.merge(actor_n, on = 'nconst', how = 'left')

In [61]:
actor_df = actor_df.merge(names, on = 'nconst', how = 'inner')

In [62]:
actor_df.head()

,nconst,averageRating,n_movies,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,nm0000003,5.900000,36,Brigitte Bardot,1934.0,NaN,"actress,soundtrack,producer","tt0057345,tt0049189,tt0059956,tt0054452"
1,nm0000014,6.809524,42,Olivia de Havilland,1916.0,NaN,"actress,soundtrack","tt0041452,tt0029843,tt0031381,tt0040806"
2,nm0000047,6.212500,64,Sophia Loren,1934.0,NaN,"actress,soundtrack","tt0060121,tt0058335,tt0076085,tt0054749"
3,nm0000079,5.656000,25,Raquel Welch,1940.0,NaN,"actress,soundtrack,producer","tt0072281,tt0061653,tt0070291,tt0068795"
4,nm0000084,6.767742,31,Li Gong,1965.0,NaN,actress,"tt0101640,tt0397535,tt0473444,tt0430357"

In [63]:
actor_df = actor_df[['primaryName', 'averageRating', 'n_movies']]
actor_df.columns = ['name', 'avg', 'n']
actor_df['type'] = 'actor'

In [64]:
actor_df.head()

                  name       avg   n   type
0      Brigitte Bardot  5.900000  36  actor
1  Olivia de Havilland  6.809524  42  actor
2         Sophia Loren  6.212500  64  actor
3         Raquel Welch  5.656000  25  actor
4              Li Gong  6.767742  31  actor

## Writers

In [65]:
writers = principals[(principals.category == 'writer')]

In [66]:
df_writer = writers.merge(df_basics, on = 'tconst', how = 'inner')

In [67]:
writer_avg = df_writer.pivot_table(values = 'averageRating',
                            index = 'nconst',
                            aggfunc = 'mean')
writer_avg.reset_index(inplace = True)

In [68]:
writer_count = df_writer.pivot_table(values = 'tconst',
                                    index = 'nconst',
                                    aggfunc = 'count')
writer_count.reset_index(inplace = True)
writer_count.rename(columns = {'tconst' : 'movies_n'}, inplace = True)

In [69]:
writer_df = writer_avg.merge(writer_count, on = 'nconst')

In [70]:
writer_df = writer_df.merge(names, on = 'nconst', how = 'inner')

In [71]:
writer_df = writer_df[['primaryName', 'averageRating', 'movies_n']]
writer_df.columns = ['name', 'avg', 'n']
writer_df['type'] = 'writer'

In [72]:
writer_df.head()

          name    avg  n    type
0  Alan Miller  8.300  1  writer
1  John Cleese  6.100  4  writer
2    J. Reifel  3.525  4  writer
3  Woody Allen  5.600  3  writer
4  Dan Aykroyd  5.200  1  writer

In [73]:
df = pd.concat([director_df, actor_df, writer_df])

In [74]:
df.head()

                  name       avg   n      type
0          Alan Miller  7.200000   1  director
1  Armin Mueller-Stahl  6.600000   1  director
2         Gérard Pirès  5.266667  12  director
3          Woody Allen  7.048936  47  director
4          Dan Aykroyd  5.100000   1  director

In [75]:
df.to_csv('df.csv', index = False)